renesas/iot-reference-rl78/Middleware/Application-Protocols/network_transport/sockets_wrapper/ports/cellular_ryz024a/sockets_wrapper.c
    /* Adjust the tick count for the number of times a TickType_t has overflowed. */
    ullTickCount = ( uint64_t ) ( xCurrentTime.xOverflowCount ) << ( sizeof( TickType_t ) * 8 );

    /* Add the current tick count. */
    ullTickCount += xCurrentTime.xTimeOnEntering;

    /* Return the ticks converted to milliseconds. */
    return ullTickCount * _MILLISECONDS_PER_TICK;
}

/*-----------------------------------------------------------*/

static BaseType_t prvNetworkRecvCellular( const cellularSocketWrapper_t * pCellularSocketContext,
                                          uint8_t * buf,
                                          size_t len )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    CellularSocketHandle_t cellularSocketHandle;
    BaseType_t retRecvLength;
    uint32_t recvLength = 0;
    EventBits_t waitEventBits;
    uint16_t soketdatasize = 0;

    cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

    /* Wait for +SQNSRING */
    waitEventBits = xEventGroupWaitBits( pCellularSocketContext->socketEventGroupHandle,
                                         SOCKET_DATA_RECEIVED_CALLBACK_BIT | SOCKET_CLOSE_CALLBACK_BIT,
                                         pdFALSE,
                                         pdFALSE,
                                         10 );

    if( ( waitEventBits & SOCKET_DATA_RECEIVED_CALLBACK_BIT ) != 0U )
    {
        ( void ) Cellular_SocketRecv( CellularHandle, cellularSocketHandle, buf, len, &recvLength );
        ( void ) Cellular_GetSocketDataSize( CellularHandle, cellularSocketHandle, &soketdatasize );
        if (soketdatasize == 0)
        {
            ( void ) xEventGroupClearBits( pCellularSocketContext->socketEventGroupHandle,
                                           SOCKET_DATA_RECEIVED_CALLBACK_BIT );
        }
        retRecvLength = ( BaseType_t ) recvLength;
    }
    else if( ( waitEventBits & SOCKET_CLOSE_CALLBACK_BIT ) != 0U )
    {
        IotLogDebug( "prvNetworkRecv failed %d", socketStatus );
        retRecvLength = TCP_SOCKETS_ERRNO_ERROR;
    }
    else
    {
        /* No data */
        retRecvLength = 0;
    }

    IotLogDebug( "prvNetworkRecv expect %d read %d", len, recvLength );
    return retRecvLength;
#else
    CellularSocketHandle_t cellularSocketHandle = NULL;
    BaseType_t retRecvLength = 0;
    uint32_t recvLength = 0;
    TickType_t recvTimeout = 0;
    TickType_t recvStartTime = 0;
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    EventBits_t waitEventBits = 0;
    uint16_t soketdatasize = 0;

    cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

    if( pCellularSocketContext->cellularSocketHandle->recvTimeoutMs >= portMAX_DELAY )
    {
        recvTimeout = portMAX_DELAY;
    }
    else
    {
        recvTimeout = pCellularSocketContext->cellularSocketHandle->recvTimeoutMs;
    }

    recvStartTime = xTaskGetTickCount();

    ( void ) xEventGroupClearBits( pCellularSocketContext->socketEventGroupHandle,
                                   SOCKET_DATA_RECEIVED_CALLBACK_BIT );

    socketStatus = Cellular_GetSocketDataSize(CellularHandle, cellularSocketHandle, &soketdatasize);

    if ( ( socketStatus == CELLULAR_SUCCESS ) && ( 0 != soketdatasize ) )
    {
        socketStatus = Cellular_SocketRecv( CellularHandle, cellularSocketHandle, buf, len, &recvLength );
    }

    if( ( socketStatus == CELLULAR_SUCCESS ) && ( recvLength == 0U ) )
    {
        /* Calculate remain recvTimeout. */
        if( recvTimeout != portMAX_DELAY )
        {
            if( ( recvStartTime + recvTimeout ) > xTaskGetTickCount() )
            {
                recvTimeout = recvTimeout - ( xTaskGetTickCount() - recvStartTime );
            }
            else
            {
                recvTimeout = 0;
            }
        }

        waitEventBits = xEventGroupWaitBits( pCellularSocketContext->socketEventGroupHandle,
                                             SOCKET_DATA_RECEIVED_CALLBACK_BIT | SOCKET_CLOSE_CALLBACK_BIT,
                                             pdTRUE,
                                             pdFALSE,
                                             recvTimeout );

        if( ( waitEventBits & SOCKET_CLOSE_CALLBACK_BIT ) != 0U )
        {
            socketStatus = CELLULAR_SOCKET_CLOSED;
        }
        else if( ( waitEventBits & SOCKET_DATA_RECEIVED_CALLBACK_BIT ) != 0U )
        {
            socketStatus = Cellular_SocketRecv( CellularHandle, cellularSocketHandle, buf, len, &recvLength );
        }
        else
        {
            IotLogInfo( "prvNetworkRecv timeout" );
            socketStatus = CELLULAR_SUCCESS;
            recvLength = 0;
        }
    }

    if( socketStatus == CELLULAR_SUCCESS )
    {
        retRecvLength = ( BaseType_t ) recvLength;
    }
    else
    {
        IotLogError( "prvNetworkRecv failed %d", socketStatus );
        retRecvLength = TCP_SOCKETS_ERRNO_ERROR;
    }

    IotLogDebug( "prvNetworkRecv expect %d read %d", len, recvLength );
    return retRecvLength;
#endif
}

/*-----------------------------------------------------------*/
static void prvCellularSocketOpenCallback( CellularUrcEvent_t urcEvent,
                                          CellularSocketHandle_t socketHandle,
                                          void * pCallbackContext )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) pCallbackContext;

    ( void ) socketHandle;

    IotLogDebug( "Socket open callback on Socket %p %d %d.",
                 pCellularSocketContext, socketHandle, urcEvent );

    if( urcEvent == CELLULAR_URC_SOCKET_OPENED )
    {
        pCellularSocketContext->ulFlags = pCellularSocketContext->ulFlags | CELLULAR_SOCKET_CONNECT_FLAG;
        ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle,
                                     SOCKET_OPEN_CALLBACK_BIT );
    }
    else
    {
        /* Socket open failed. */
        ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle,
                                     SOCKET_OPEN_FAILED_CALLBACK_BIT );
    }
#else
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) pCallbackContext;

    ( void ) socketHandle;

    if( pCellularSocketContext != NULL )
    {
        IotLogDebug( "Socket open callback on Socket %p %d %d.", 
                     pCellularSocketContext, socketHandle, urcEvent );

        if( urcEvent == CELLULAR_URC_SOCKET_OPENED )
        {
            pCellularSocketContext->ulFlags = pCellularSocketContext->ulFlags | CELLULAR_SOCKET_CONNECT_FLAG;
            ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle, 
                                         SOCKET_OPEN_CALLBACK_BIT );
        }
        else
        {
            /* Socket open failed. */
            ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle, 
                                         SOCKET_OPEN_FAILED_CALLBACK_BIT );
        }
    }
    else
    {
        IotLogDebug( "Spurious socket open callback." );
    }
#endif
}
/*-----------------------------------------------------------*/

