renesas/iot-reference-rl78/Middleware/Application-Protocols/network_transport/sockets_wrapper/ports/cellular_ryz024a/sockets_wrapper.c
static void prvCellularSocketDataReadyCallback( CellularSocketHandle_t socketHandle,
                                                void * pCallbackContext )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) pCallbackContext;

    ( void ) socketHandle;

    IotLogDebug( "Data ready on Socket %p", pCellularSocketContext );
    ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle,
                                 SOCKET_DATA_RECEIVED_CALLBACK_BIT );
#else
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) pCallbackContext;

    ( void ) socketHandle;

    if( pCellularSocketContext != NULL )
    {
        IotLogDebug( "Data ready on Socket %p", pCellularSocketContext );
        ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle, 
                                     SOCKET_DATA_RECEIVED_CALLBACK_BIT );
    }
    else
    {
        IotLogDebug( "spurious data callback" );
    }
#endif
}

/*-----------------------------------------------------------*/

static void prvCellularSocketClosedCallback( CellularSocketHandle_t socketHandle,
                                             void * pCallbackContext )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) pCallbackContext;

    ( void ) socketHandle;

    IotLogInfo( "Socket Close on Socket %p", pCellularSocketContext );
    pCellularSocketContext->ulFlags = pCellularSocketContext->ulFlags & ( ~CELLULAR_SOCKET_CONNECT_FLAG );
    ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle,
                                 SOCKET_CLOSE_CALLBACK_BIT );
#else
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) pCallbackContext;

    ( void ) socketHandle;

    if( pCellularSocketContext != NULL )
    {
        IotLogInfo( "Socket Close on Socket %p", pCellularSocketContext );
        pCellularSocketContext->ulFlags = pCellularSocketContext->ulFlags & ( ~CELLULAR_SOCKET_CONNECT_FLAG );
        ( void ) xEventGroupSetBits( pCellularSocketContext->socketEventGroupHandle, 
                                     SOCKET_CLOSE_CALLBACK_BIT );
    }
    else
    {
        IotLogDebug( "spurious socket close callback" );
    }
#endif
}

/*-----------------------------------------------------------*/

static BaseType_t prvSetupSocketRecvTimeout( cellularSocketWrapper_t * pCellularSocketContext,
                                             TickType_t receiveTimeout )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    BaseType_t retSetSockOpt = TCP_SOCKETS_ERRNO_NONE;
    uint32_t receiveTimeoutMs = 0;
    CellularSocketHandle_t cellularSocketHandle;

    cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

    if( receiveTimeout >= UINT32_MAX_MS_TICKS )
    {
        /* Check if the ticks cause overflow. */
        receiveTimeoutMs = UINT32_MAX_DELAY_MS;
    }
    else if( receiveTimeout >= portMAX_DELAY )
    {
        IotLogDebug( "Receive timeout %d longer than portMAX_DELAY, %d ms is used instead",
                     receiveTimeout, UINT32_MAX_DELAY_MS );
        receiveTimeoutMs = UINT32_MAX_DELAY_MS;
    }
    else
    {
        receiveTimeoutMs = TICKS_TO_MS( receiveTimeout );
    }

    socketStatus = Cellular_CommonSocketSetSockOpt( CellularHandle,
                                                    cellularSocketHandle,
                                                    CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                    CELLULAR_SOCKET_OPTION_RECV_TIMEOUT,
                                                    ( const uint8_t * ) &receiveTimeoutMs,
                                                    sizeof( uint32_t ) );

    if( socketStatus != CELLULAR_SUCCESS )
    {
        retSetSockOpt = TCP_SOCKETS_ERRNO_EINVAL;
    }

    return retSetSockOpt;
#else
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    BaseType_t retSetSockOpt = TCP_SOCKETS_ERRNO_NONE;
    uint32_t receiveTimeoutMs = 0;
    CellularSocketHandle_t cellularSocketHandle = NULL;

#ifdef TOMO
    if( pCellularSocketContext == NULL )
    {
        retSetSockOpt = TCP_SOCKETS_ERRNO_EINVAL;
    }
    else
    {
#endif
        cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

        if( receiveTimeout >= UINT32_MAX_MS_TICKS )
        {
            /* Check if the ticks cause overflow. */
            receiveTimeoutMs = UINT32_MAX_DELAY_MS;
        }
        else if( receiveTimeout >= portMAX_DELAY )
        {
            IotLogDebug( "Receive timeout %d longer than portMAX_DELAY, %d ms is used instead",
                         receiveTimeout, UINT32_MAX_DELAY_MS );
            receiveTimeoutMs = UINT32_MAX_DELAY_MS;
        }
        else
        {
            receiveTimeoutMs = TICKS_TO_MS( receiveTimeout );
        }

#ifndef TOMO
        socketStatus = Cellular_CommonSocketSetSockOpt( CellularHandle,
                                                        cellularSocketHandle,
                                                        CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                        CELLULAR_SOCKET_OPTION_RECV_TIMEOUT,
                                                        ( const uint8_t * ) &receiveTimeoutMs,
                                                        sizeof( uint32_t ) );
#else
        socketStatus = Cellular_SocketSetSockOpt( CellularHandle,
                                                  cellularSocketHandle,
                                                  CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                  CELLULAR_SOCKET_OPTION_RECV_TIMEOUT,
                                                  ( const uint8_t * ) &receiveTimeoutMs,
                                                  sizeof( uint32_t ) );
#endif

        if( socketStatus != CELLULAR_SUCCESS )
        {
            retSetSockOpt = TCP_SOCKETS_ERRNO_EINVAL;
        }
#ifdef TOMO
    }
#endif

    return retSetSockOpt;
#endif
}

/*-----------------------------------------------------------*/

static BaseType_t prvSetupSocketSendTimeout( cellularSocketWrapper_t * pCellularSocketContext,
                                             TickType_t sendTimeout )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    BaseType_t retSetSockOpt = TCP_SOCKETS_ERRNO_NONE;
    uint32_t sendTimeoutMs;
    CellularSocketHandle_t cellularSocketHandle;

    cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

    if( sendTimeout >= UINT32_MAX_MS_TICKS )
    {
        /* Check if the ticks cause overflow. */
        sendTimeoutMs = UINT32_MAX_DELAY_MS;
    }
    else if( sendTimeout >= portMAX_DELAY )
    {
        IotLogDebug( "Send timeout %d longer than portMAX_DELAY, %d ms is used instead",
                      sendTimeout, UINT32_MAX_DELAY_MS );
        sendTimeoutMs = UINT32_MAX_DELAY_MS;
    }
    else
    {
        sendTimeoutMs = TICKS_TO_MS( sendTimeout );
    }

    socketStatus = Cellular_CommonSocketSetSockOpt( CellularHandle,
                                                    cellularSocketHandle,
                                                    CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                    CELLULAR_SOCKET_OPTION_SEND_TIMEOUT,
                                                    ( const uint8_t * ) &sendTimeoutMs,
                                                    sizeof( uint32_t ) );

    if( socketStatus != CELLULAR_SUCCESS )
    {
        retSetSockOpt = TCP_SOCKETS_ERRNO_EINVAL;
    }

    return retSetSockOpt;
#else
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    BaseType_t retSetSockOpt = TCP_SOCKETS_ERRNO_NONE;
    uint32_t sendTimeoutMs = 0;
    CellularSocketHandle_t cellularSocketHandle = NULL;

    if( pCellularSocketContext == NULL )
    {
        retSetSockOpt = TCP_SOCKETS_ERRNO_EINVAL;
    }
    else
    {
        cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

        if( sendTimeout >= UINT32_MAX_MS_TICKS )
        {
            /* Check if the ticks cause overflow. */
            sendTimeoutMs = UINT32_MAX_DELAY_MS;
        }
        else if( sendTimeout >= portMAX_DELAY )
        {
            IotLogWarn( "Sendtimeout %d longer than portMAX_DELAY, %d ms is used instead",
                         sendTimeout, UINT32_MAX_DELAY_MS );
            sendTimeoutMs = UINT32_MAX_DELAY_MS;
        }
        else
        {
            sendTimeoutMs = TICKS_TO_MS( sendTimeout );
        }

