renesas/iot-reference-rl78/Middleware/Application-Protocols/network_transport/sockets_wrapper/ports/cellular_ryz024a/sockets_wrapper.c
        socketStatus = Cellular_SocketSetSockOpt( CellularHandle,
                                                  cellularSocketHandle,
                                                  CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                  CELLULAR_SOCKET_OPTION_SEND_TIMEOUT,
                                                  ( const uint8_t * ) &sendTimeoutMs,
                                                  sizeof( uint32_t ) );

        if( socketStatus != CELLULAR_SUCCESS )
        {
            retSetSockOpt = TCP_SOCKETS_ERRNO_EINVAL;
        }
    }

    return retSetSockOpt;
#endif
}

/*-----------------------------------------------------------*/

static BaseType_t prvCellularSocketRegisterCallback( CellularSocketHandle_t cellularSocketHandle,
                                                     cellularSocketWrapper_t * pCellularSocketContext )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    if( Cellular_CommonSocketRegisterDataReadyCallback( CellularHandle, cellularSocketHandle,
            prvCellularSocketDataReadyCallback, ( void * ) pCellularSocketContext) != CELLULAR_SUCCESS )
    {
        IotLogDebug( "Failed to SocketRegisterDataReadyCallback. Socket status %d.", socketStatus );
        return TCP_SOCKETS_ERRNO_ERROR;
    }

    if( Cellular_CommonSocketRegisterSocketOpenCallback( CellularHandle, cellularSocketHandle,
            prvCellularSocketOpenCallback, ( void * ) pCellularSocketContext ) != CELLULAR_SUCCESS )
    {
        IotLogDebug( "Failed to SocketRegisterSocketOpenCallbac. Socket status %d.", socketStatus );
        return TCP_SOCKETS_ERRNO_ERROR;
    }

    if( Cellular_CommonSocketRegisterClosedCallback( CellularHandle, cellularSocketHandle,
            prvCellularSocketClosedCallback, ( void * ) pCellularSocketContext ) != CELLULAR_SUCCESS )
    {
        IotLogDebug( "Failed to SocketRegisterClosedCallback. Socket status %d.", socketStatus );
        return TCP_SOCKETS_ERRNO_ERROR;
    }

    return TCP_SOCKETS_ERRNO_NONE;
#else
    BaseType_t retRegCallback = TCP_SOCKETS_ERRNO_NONE;
    CellularError_t socketStatus = CELLULAR_SUCCESS;

    if( cellularSocketHandle == NULL )
    {
        retRegCallback = TCP_SOCKETS_ERRNO_EINVAL;
    }

    if( retRegCallback == TCP_SOCKETS_ERRNO_NONE )
    {
        socketStatus = Cellular_SocketRegisterDataReadyCallback( CellularHandle, cellularSocketHandle,
                                                                 prvCellularSocketDataReadyCallback, ( void * ) pCellularSocketContext );

        if( socketStatus != CELLULAR_SUCCESS )
        {
            IotLogError( "Failed to SocketRegisterDataReadyCallback. Socket status %d.", socketStatus );
            retRegCallback = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    if( retRegCallback == TCP_SOCKETS_ERRNO_NONE )
    {
        socketStatus = Cellular_SocketRegisterSocketOpenCallback( CellularHandle, cellularSocketHandle,
                                                                  prvCellularSocketOpenCallback, ( void * ) pCellularSocketContext );

        if( socketStatus != CELLULAR_SUCCESS )
        {
            IotLogError( "Failed to SocketRegisterSocketOpenCallbac. Socket status %d.", socketStatus );
            retRegCallback = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    if( retRegCallback == TCP_SOCKETS_ERRNO_NONE )
    {
        socketStatus = Cellular_SocketRegisterClosedCallback( CellularHandle, cellularSocketHandle,
                                                              prvCellularSocketClosedCallback, ( void * ) pCellularSocketContext );

        if( socketStatus != CELLULAR_SUCCESS )
        {
            IotLogError( "Failed to SocketRegisterClosedCallback. Socket status %d.", socketStatus );
            retRegCallback = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    return retRegCallback;
#endif
}

/*-----------------------------------------------------------*/

static bool _calculateElapsedTime( uint64_t entryTimeMs,
                                   uint32_t timeoutValueMs,
                                   uint64_t * pElapsedTimeMs )
{
    uint64_t currentTimeMs = getTimeMs();
    bool isExpired = false;

    /* timeoutValueMs with UINT32_MAX_DELAY_MS means wait for ever, same behavior as freertos_plus_tcp. */
    if( timeoutValueMs == UINT32_MAX_DELAY_MS )
    {
        isExpired = false;
    }

    /* timeoutValueMs = 0 means none blocking mode. */
    else if( timeoutValueMs == 0U )
    {
        isExpired = true;
    }
    else
    {
        *pElapsedTimeMs = currentTimeMs - entryTimeMs;

        if( ( currentTimeMs - entryTimeMs ) >= timeoutValueMs )
        {
            isExpired = true;
        }
        else
        {
            isExpired = false;
        }
    }

    return isExpired;
}

/*-----------------------------------------------------------*/

BaseType_t TCP_Sockets_Connect( Socket_t * pTcpSocket,
                                const char * pHostName,
                                uint16_t port,
                                uint32_t receiveTimeoutMs,
                                uint32_t sendTimeoutMs )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    CellularSocketHandle_t cellularSocketHandle;
    cellularSocketWrapper_t * pCellularSocketContext = NULL;
    CellularError_t cellularSocketStatus;

    CellularSocketAddress_t serverAddress;
    EventBits_t waitEventBits = 0;
    BaseType_t retConnect = TCP_SOCKETS_ERRNO_NONE;
    const uint32_t defaultReceiveTimeoutMs = CELLULAR_SOCKET_RECV_TIMEOUT_MS;

    /* Create a new TCP socket. */
    cellularSocketStatus = Cellular_CommonCreateSocket( CellularHandle,
                                                        CellularSocketPdnContextId,
                                                        CELLULAR_SOCKET_DOMAIN_AF_INET,
                                                        CELLULAR_SOCKET_TYPE_STREAM,
                                                        CELLULAR_SOCKET_PROTOCOL_TCP,
                                                        &cellularSocketHandle );

    if( CELLULAR_SUCCESS != cellularSocketStatus )
    {
        IotLogDebug( "Failed to create cellular sockets. %d", cellularStatus );
        retConnect = TCP_SOCKETS_ERRNO_ERROR;
    }

    /* Allocate socket context. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        pCellularSocketContext = pvPortMalloc( sizeof( cellularSocketWrapper_t ) );

        if( pCellularSocketContext == NULL )
        {
            IotLogDebug( "Failed to allocate new socket context." );
            ( void ) Cellular_SocketClose( CellularHandle, cellularSocketHandle );
            retConnect = TCP_SOCKETS_ERRNO_ENOMEM;
        }
        else
        {
            /* Initialize all the members to sane values. */
            IotLogDebug( "Created CELLULAR Socket %p.", pCellularSocketContext );
            ( void ) memset( pCellularSocketContext, 0, sizeof( cellularSocketWrapper_t ) );
            pCellularSocketContext->cellularSocketHandle = cellularSocketHandle;
            pCellularSocketContext->ulFlags |= CELLULAR_SOCKET_OPEN_FLAG;
            pCellularSocketContext->socketEventGroupHandle = NULL;
        }
    }

    /* Allocate event group for callback function. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        pCellularSocketContext->socketEventGroupHandle = xEventGroupCreate();

        if( pCellularSocketContext->socketEventGroupHandle == NULL )
        {
            IotLogDebug( "Failed create cellular socket eventGroupHandle %p.", pCellularSocketContext );
            retConnect = TCP_SOCKETS_ERRNO_ENOMEM;
        }
    }

    /* Setup TLS socket */
    /* AT+SQNSPCFG */
    cellularSocketStatus = Cellular_ConfigSSLProfile( CellularHandle,
                                                      cellularSocketHandle->socketId + 1U,
                                                      AWS_CELLULAR_VALIDATE_CERT_EXPDATE_CN,
                                                      ROOTCA_PEM2_NVM_IDX,
                                                      CLIENT_CERT_NVM_IDX,
                                                      CLIENT_PRIVATEKEY_NVM_IDX );
    if( CELLULAR_SUCCESS != cellularSocketStatus )
    {
        retConnect = TCP_SOCKETS_ERRNO_ENOTCONN;
    }

