renesas/iot-reference-rl78/Middleware/Application-Protocols/network_transport/sockets_wrapper/ports/cellular_ryz024a/sockets_wrapper.c
    /* AT+SQNSSCFG */
    cellularSocketStatus = Cellular_ConfigTlslSocket( CellularHandle,
                                                      cellularSocketHandle->socketId + 1U,
                                                      true,
                                                      cellularSocketHandle->socketId + 1U );
    if( CELLULAR_SUCCESS != cellularSocketStatus )
    {
        retConnect = TCP_SOCKETS_ERRNO_ENOTCONN;
    }

    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        cellularSocketStatus = Sockets_GetHostByName(pHostName, (const uint8_t *)serverAddress.ipAddress.ipAddress);
        if( cellularSocketStatus == CELLULAR_SUCCESS )
        {
            serverAddress.ipAddress.ipAddressType = CELLULAR_IP_ADDRESS_V4;
            serverAddress.port = port;

            LogDebug( ( "Ip address %s port %d\r\n", serverAddress.ipAddress.ipAddress, serverAddress.port ) );
            retConnect = prvCellularSocketRegisterCallback( cellularSocketHandle, pCellularSocketContext );
        }
        else
        {
            IotLogDebug( "Failed Get Host By Name." );
        }
    }

    /* Setup cellular socket recv AT command default timeout. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        cellularSocketStatus = Cellular_CommonSocketSetSockOpt( CellularHandle,
                                                                cellularSocketHandle,
                                                                CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                                CELLULAR_SOCKET_OPTION_RECV_TIMEOUT,
                                                                ( const uint8_t * ) &defaultReceiveTimeoutMs,
                                                                sizeof( uint32_t ) );
        if( cellularSocketStatus != CELLULAR_SUCCESS )
        {
            IotLogDebug( "Failed to setup cellular AT command receive timeout %d.", cellularStatus );
            retConnect = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    /* Setup cellular socket send/recv timeout. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        retConnect = prvSetupSocketSendTimeout( pCellularSocketContext, pdMS_TO_TICKS( sendTimeoutMs ) );
    }

    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        retConnect = prvSetupSocketRecvTimeout( pCellularSocketContext, pdMS_TO_TICKS( receiveTimeoutMs ) );
    }

    /* Cellular socket connect. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        ( void ) xEventGroupClearBits( pCellularSocketContext->socketEventGroupHandle,
                                       SOCKET_DATA_RECEIVED_CALLBACK_BIT | SOCKET_OPEN_FAILED_CALLBACK_BIT );
        cellularSocketStatus = Cellular_SocketConnect( CellularHandle, cellularSocketHandle, CELLULAR_SOCKET_ACCESS_MODE, &serverAddress );

        if( cellularSocketStatus != CELLULAR_SUCCESS )
        {
            IotLogDebug( "Failed to establish new connection. Socket status %d.", cellularStatus );
            retConnect = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    /* Wait the socket connection. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        waitEventBits = xEventGroupWaitBits( pCellularSocketContext->socketEventGroupHandle,
                                             SOCKET_OPEN_CALLBACK_BIT | SOCKET_OPEN_FAILED_CALLBACK_BIT,
                                             pdTRUE,
                                             pdFALSE,
                                             CELLULAR_SOCKET_OPEN_TIMEOUT_TICKS );

        if( waitEventBits != SOCKET_OPEN_CALLBACK_BIT )
        {
            IotLogDebug( "Socket connect timeout." );
            retConnect = TCP_SOCKETS_ERRNO_ENOTCONN;
        }
    }

    /* Cleanup the socket if any error. */
    if( retConnect != TCP_SOCKETS_ERRNO_NONE )
    {
        if( cellularSocketHandle != NULL )
        {
            ( void ) Cellular_SocketClose( CellularHandle, cellularSocketHandle );
            ( void ) Cellular_CommonSocketRegisterDataReadyCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            ( void ) Cellular_CommonSocketRegisterSocketOpenCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            ( void ) Cellular_CommonSocketRegisterClosedCallback( CellularHandle, cellularSocketHandle, NULL, NULL );

            if( pCellularSocketContext != NULL )
            {
                pCellularSocketContext->cellularSocketHandle = NULL;
            }
        }

        if( ( pCellularSocketContext != NULL ) && ( pCellularSocketContext->socketEventGroupHandle != NULL ) )
        {
            vEventGroupDelete( pCellularSocketContext->socketEventGroupHandle );
            pCellularSocketContext->socketEventGroupHandle = NULL;
        }

        if( pCellularSocketContext != NULL )
        {
            vPortFree( pCellularSocketContext );
            pCellularSocketContext = NULL;
        }
    }

    *pTcpSocket = pCellularSocketContext;

    return retConnect;
#else /* defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL) */
    CellularSocketHandle_t cellularSocketHandle = NULL;
    cellularSocketWrapper_t * pCellularSocketContext = NULL;
    CellularError_t cellularSocketStatus = CELLULAR_INVALID_HANDLE;

    CellularSocketAddress_t serverAddress;
    EventBits_t waitEventBits = 0;
    BaseType_t retConnect = TCP_SOCKETS_ERRNO_NONE;
    const uint32_t defaultReceiveTimeoutMs = CELLULAR_SOCKET_RECV_TIMEOUT_MS;

    /* Create a new TCP socket. */
    cellularSocketStatus = Cellular_CreateSocket( CellularHandle,
                                                  CellularSocketPdnContextId,
                                                  CELLULAR_SOCKET_DOMAIN_AF_INET,
                                                  CELLULAR_SOCKET_TYPE_STREAM,
                                                  CELLULAR_SOCKET_PROTOCOL_TCP,
                                                  &cellularSocketHandle );

    if( CELLULAR_SUCCESS != cellularSocketStatus )
    {
        IotLogDebug( "Failed to create cellular sockets. %d", cellularStatus );
        retConnect = TCP_SOCKETS_ERRNO_ERROR;
    }

    /* Allocate socket context. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        pCellularSocketContext = pvPortMalloc( sizeof( cellularSocketWrapper_t ) );

        if( pCellularSocketContext == NULL )
        {
            IotLogDebug( "Failed to allocate new socket context." );
            ( void ) Cellular_SocketClose( CellularHandle, cellularSocketHandle );
            retConnect = TCP_SOCKETS_ERRNO_ENOMEM;
        }
        else
        {
            /* Initialize all the members to sane values. */
            IotLogDebug( "Created CELLULAR Socket %p.", pCellularSocketContext );
            ( void ) memset( pCellularSocketContext, 0, sizeof( cellularSocketWrapper_t ) );
            pCellularSocketContext->cellularSocketHandle = cellularSocketHandle;
            pCellularSocketContext->ulFlags |= CELLULAR_SOCKET_OPEN_FLAG;
            pCellularSocketContext->socketEventGroupHandle = NULL;
        }
    }

    /* Allocate event group for callback function. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        pCellularSocketContext->socketEventGroupHandle = xEventGroupCreate();

        if( pCellularSocketContext->socketEventGroupHandle == NULL )
        {
            IotLogDebug( "Failed create cellular socket eventGroupHandle %p.", pCellularSocketContext );
            retConnect = TCP_SOCKETS_ERRNO_ENOMEM;
        }
    }

    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        cellularSocketStatus = Sockets_GetHostByName(pHostName, (const uint8_t *)serverAddress.ipAddress.ipAddress);
        if( cellularSocketStatus == CELLULAR_SUCCESS )
        {
            serverAddress.ipAddress.ipAddressType = CELLULAR_IP_ADDRESS_V4;
            serverAddress.port = port;

            LogDebug( ( "Ip address %s port %d\r\n", serverAddress.ipAddress.ipAddress, serverAddress.port ) );
            retConnect = prvCellularSocketRegisterCallback( cellularSocketHandle, pCellularSocketContext );
        }
        else
        {
            IotLogDebug( "Failed Get Host By Name." );
        }
    }

    /* Setup cellular socket recv AT command default timeout. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        cellularSocketStatus = Cellular_SocketSetSockOpt( CellularHandle,
                                                          cellularSocketHandle,
                                                          CELLULAR_SOCKET_OPTION_LEVEL_TRANSPORT,
                                                          CELLULAR_SOCKET_OPTION_RECV_TIMEOUT,
                                                          ( const uint8_t * ) &defaultReceiveTimeoutMs,
                                                          sizeof( uint32_t ) );
        if( cellularSocketStatus != CELLULAR_SUCCESS )
        {
            IotLogDebug( "Failed to setup cellular AT command receive timeout %d.", cellularStatus );
            retConnect = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    /* Setup cellular socket send/recv timeout. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        retConnect = prvSetupSocketSendTimeout( pCellularSocketContext, pdMS_TO_TICKS( sendTimeoutMs ) );
    }

    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        retConnect = prvSetupSocketRecvTimeout( pCellularSocketContext, pdMS_TO_TICKS( receiveTimeoutMs ) );
    }

    /* Cellular socket connect. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        ( void ) xEventGroupClearBits( pCellularSocketContext->socketEventGroupHandle,
                                       SOCKET_DATA_RECEIVED_CALLBACK_BIT | SOCKET_OPEN_FAILED_CALLBACK_BIT );
        cellularSocketStatus = Cellular_SocketConnect( CellularHandle, cellularSocketHandle, CELLULAR_SOCKET_ACCESS_MODE, &serverAddress );

        if( cellularSocketStatus != CELLULAR_SUCCESS )
        {
            IotLogDebug( "Failed to establish new connection. Socket status %d.", cellularStatus );
            retConnect = TCP_SOCKETS_ERRNO_ERROR;
        }
    }

    /* Wait the socket connection. */
    if( retConnect == TCP_SOCKETS_ERRNO_NONE )
    {
        waitEventBits = xEventGroupWaitBits( pCellularSocketContext->socketEventGroupHandle,
                                             SOCKET_OPEN_CALLBACK_BIT | SOCKET_OPEN_FAILED_CALLBACK_BIT,
                                             pdTRUE,
                                             pdFALSE,
                                             CELLULAR_SOCKET_OPEN_TIMEOUT_TICKS );

        if( waitEventBits != SOCKET_OPEN_CALLBACK_BIT )
        {
            IotLogDebug( "Socket connect timeout." );
            retConnect = TCP_SOCKETS_ERRNO_ENOTCONN;
        }
    }

