renesas/iot-reference-rl78/Middleware/Application-Protocols/network_transport/sockets_wrapper/ports/cellular_ryz024a/sockets_wrapper.c
    /* Cleanup the socket if any error. */
    if( retConnect != TCP_SOCKETS_ERRNO_NONE )
    {
        if( cellularSocketHandle != NULL )
        {
            ( void ) Cellular_SocketClose( CellularHandle, cellularSocketHandle );
            ( void ) Cellular_SocketRegisterDataReadyCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            ( void ) Cellular_SocketRegisterSocketOpenCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            ( void ) Cellular_SocketRegisterClosedCallback( CellularHandle, cellularSocketHandle, NULL, NULL );

            if( pCellularSocketContext != NULL )
            {
                pCellularSocketContext->cellularSocketHandle = NULL;
            }
        }

        if( ( pCellularSocketContext != NULL ) && ( pCellularSocketContext->socketEventGroupHandle != NULL ) )
        {
            vEventGroupDelete( pCellularSocketContext->socketEventGroupHandle );
            pCellularSocketContext->socketEventGroupHandle = NULL;
        }

        if( pCellularSocketContext != NULL )
        {
            vPortFree( pCellularSocketContext );
            pCellularSocketContext = NULL;
        }
    }

    *pTcpSocket = pCellularSocketContext;

    return retConnect;
#endif
}

/*-----------------------------------------------------------*/

void TCP_Sockets_Disconnect( Socket_t xSocket )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) xSocket;
    CellularSocketHandle_t cellularSocketHandle;

    /* xSocket need to be check against SOCKET_INVALID_SOCKET. */
    /* coverity[misra_c_2012_rule_11_4_violation] */
    cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

    if( cellularSocketHandle != NULL )
    {
        /* Close sockets. */
        ( void ) Cellular_SocketClose( CellularHandle, cellularSocketHandle );
        ( void ) Cellular_CommonSocketRegisterDataReadyCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
        ( void ) Cellular_CommonSocketRegisterSocketOpenCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
        ( void ) Cellular_CommonSocketRegisterClosedCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
        pCellularSocketContext->cellularSocketHandle = NULL;
    }

    if( pCellularSocketContext->socketEventGroupHandle != NULL )
    {
        vEventGroupDelete( pCellularSocketContext->socketEventGroupHandle );
        pCellularSocketContext->socketEventGroupHandle = NULL;
    }

    vPortFree( pCellularSocketContext );
#else
    int32_t retClose = TCP_SOCKETS_ERRNO_NONE;
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) xSocket;
    CellularSocketHandle_t cellularSocketHandle = NULL;

    /* xSocket need to be check against SOCKET_INVALID_SOCKET. */
    /* coverity[misra_c_2012_rule_11_4_violation] */
    if( ( pCellularSocketContext == NULL ) || ( xSocket == SOCKETS_INVALID_SOCKET ) )
    {
        IotLogError( "Invalid xSocket %p", pCellularSocketContext );
        retClose = TCP_SOCKETS_ERRNO_EINVAL;
    }
    else
    {
        cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;
    }

    if( retClose == TCP_SOCKETS_ERRNO_NONE )
    {
        if( cellularSocketHandle != NULL )
        {
            /* Close sockets. */
            if( Cellular_SocketClose( CellularHandle, cellularSocketHandle ) != CELLULAR_SUCCESS )
            {
                IotLogWarn( "Failed to destroy connection." );
                retClose = TCP_SOCKETS_ERRNO_ERROR;
            }

            ( void ) Cellular_SocketRegisterDataReadyCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            ( void ) Cellular_SocketRegisterSocketOpenCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            ( void ) Cellular_SocketRegisterClosedCallback( CellularHandle, cellularSocketHandle, NULL, NULL );
            pCellularSocketContext->cellularSocketHandle = NULL;
        }

        if( pCellularSocketContext->socketEventGroupHandle != NULL )
        {
            vEventGroupDelete( pCellularSocketContext->socketEventGroupHandle );
            pCellularSocketContext->socketEventGroupHandle = NULL;
        }

        vPortFree( pCellularSocketContext );
    }

    (void) retClose;
    IotLogDebug( "Sockets close exit with code %d", retClose );
#endif
}

/*-----------------------------------------------------------*/

int32_t TCP_Sockets_Recv( Socket_t xSocket,
                          void * pvBuffer,
                          size_t xBufferLength )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) xSocket;
    uint8_t * buf = ( uint8_t * ) pvBuffer;

    return prvNetworkRecvCellular( pCellularSocketContext, buf, xBufferLength );
#else
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) xSocket;
    uint8_t * buf = ( uint8_t * ) pvBuffer;
    BaseType_t retRecvLength = 0;

    if( pCellularSocketContext == NULL )
    {
        IotLogDebug( "Cellular prvNetworkRecv Invalid xSocket %p", pCellularSocketContext );
        retRecvLength = ( BaseType_t ) TCP_SOCKETS_ERRNO_EINVAL;
    }
    else if( ( ( pCellularSocketContext->ulFlags & CELLULAR_SOCKET_OPEN_FLAG ) == 0U ) ||
             ( ( pCellularSocketContext->ulFlags & CELLULAR_SOCKET_CONNECT_FLAG ) == 0U ) )
    {
        IotLogDebug( "Cellular prvNetworkRecv Invalid xSocket flag %p %u",
                      pCellularSocketContext, pCellularSocketContext->ulFlags );
        retRecvLength = ( BaseType_t ) TCP_SOCKETS_ERRNO_ENOTCONN;
    }
    else
    {
        retRecvLength = prvNetworkRecvCellular( pCellularSocketContext, buf, xBufferLength );
    }

    return retRecvLength;
#endif
}

/*-----------------------------------------------------------*/

/* This function sends the data until timeout or data is completely sent to server.
 * Send timeout unit is TickType_t. Any timeout value greater than UINT32_MAX_MS_TICKS
 * or portMAX_DELAY will be regarded as MAX delay. In this case, this function
 * will not return until all bytes of data are sent successfully or until an error occurs. */
int32_t TCP_Sockets_Send( Socket_t xSocket,
                          const void * pvBuffer,
                          size_t xDataLength )
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    uint8_t * buf = ( uint8_t * ) pvBuffer;
    CellularSocketHandle_t cellularSocketHandle;
    BaseType_t retSendLength = 0;
    uint32_t sentLength = 0;
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) xSocket;
    uint32_t bytesToSend = xDataLength;
    uint64_t entryTimeMs = getTimeMs();
    uint64_t elapsedTimeMs = 0;
    uint32_t sendTimeoutMs;

    if( ( ( pCellularSocketContext->ulFlags & CELLULAR_SOCKET_OPEN_FLAG ) == 0U ) ||
        ( ( pCellularSocketContext->ulFlags & CELLULAR_SOCKET_CONNECT_FLAG ) == 0U ) )
    {
        IotLogDebug( "Cellular Sockets_Send Invalid xSocket flag %p 0x%08x",
                     pCellularSocketContext, pCellularSocketContext->ulFlags );
        return ( BaseType_t ) TCP_SOCKETS_ERRNO_ERROR;
    }

    cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

    /* Convert ticks to ms delay. */
    if( pCellularSocketContext->cellularSocketHandle->sendTimeoutMs >= UINT32_MAX_MS_TICKS )
    {
        /* Check if the ticks cause overflow. */
        sendTimeoutMs = UINT32_MAX_DELAY_MS;
    }
    else if( pCellularSocketContext->cellularSocketHandle->sendTimeoutMs >= portMAX_DELAY )
    {
        IotLogDebug( "Send timeout %d longer than portMAX_DELAY, %d ms is used instead",
                     pCellularSocketContext->cellularSocketHandle->sendTimeoutMs, UINT32_MAX_DELAY_MS );
        sendTimeoutMs = UINT32_MAX_DELAY_MS;
    }
    else
    {
        sendTimeoutMs = TICKS_TO_MS( pCellularSocketContext->cellularSocketHandle->sendTimeoutMs );
    }

    /* Loop sending data until data is sent completely or timeout. */
    while( bytesToSend > 0U )
    {
        socketStatus = Cellular_SocketSend( CellularHandle,
                                            cellularSocketHandle,
                                            &buf[ retSendLength ],
                                            bytesToSend,
                                            &sentLength );

        if( socketStatus == CELLULAR_SUCCESS )
        {
            retSendLength = retSendLength + ( BaseType_t ) sentLength;
            bytesToSend = bytesToSend - sentLength;
        }

        /* Check socket status or timeout break. */
        if( ( socketStatus != CELLULAR_SUCCESS ) ||
            ( _calculateElapsedTime( entryTimeMs, sendTimeoutMs, &elapsedTimeMs ) ) )
        {
            if( socketStatus != CELLULAR_SUCCESS )
            {
                if( socketStatus == CELLULAR_SOCKET_CLOSED )
                {
                    /* Socket already closed. No data is sent. */
                    retSendLength = 0;
                }
                else
                {
                    retSendLength = ( BaseType_t ) TCP_SOCKETS_ERRNO_ERROR;
                }
            }
            break;
        }
    }

    IotLogDebug( "Sockets_Send expect %d write %d", xDataLength, sentLength );

    return retSendLength;
#else
    uint8_t * buf = ( uint8_t * ) pvBuffer;
    CellularSocketHandle_t cellularSocketHandle = NULL;
    BaseType_t retSendLength = 0;
    uint32_t sentLength = 0;
    CellularError_t socketStatus = CELLULAR_SUCCESS;
    cellularSocketWrapper_t * pCellularSocketContext = ( cellularSocketWrapper_t * ) xSocket;
    uint32_t bytesToSend = xDataLength;
    uint64_t entryTimeMs = getTimeMs();
    uint64_t elapsedTimeMs = 0;
    uint32_t sendTimeoutMs = 0;

    if( pCellularSocketContext == NULL )
    {
        IotLogError( "Cellular Sockets_Send Invalid xSocket %p", pCellularSocketContext );
        retSendLength = ( BaseType_t ) TCP_SOCKETS_ERRNO_ERROR;
    }
    else if( ( ( pCellularSocketContext->ulFlags & CELLULAR_SOCKET_OPEN_FLAG ) == 0U ) ||
             ( ( pCellularSocketContext->ulFlags & CELLULAR_SOCKET_CONNECT_FLAG ) == 0U ) )
    {
        IotLogError(  "Cellular Sockets_Send Invalid xSocket flag %p 0x%08x",
                     pCellularSocketContext, pCellularSocketContext->ulFlags );
        retSendLength = ( BaseType_t ) TCP_SOCKETS_ERRNO_ERROR;
    }
    else
    {
        cellularSocketHandle = pCellularSocketContext->cellularSocketHandle;

        /* Convert ticks to ms delay. */
        if( pCellularSocketContext->cellularSocketHandle->sendTimeoutMs >= UINT32_MAX_MS_TICKS )
        {
            /* Check if the ticks cause overflow. */
            sendTimeoutMs = UINT32_MAX_DELAY_MS;
        }
        else if( pCellularSocketContext->cellularSocketHandle->sendTimeoutMs >= portMAX_DELAY )
        {
            IotLogWarn( "Sendtimeout %d longer than portMAX_DELAY, %d ms is used instead",
                         pCellularSocketContext->cellularSocketHandle->sendTimeoutMs, UINT32_MAX_DELAY_MS );
            sendTimeoutMs = UINT32_MAX_DELAY_MS;
        }
        else
        {
            sendTimeoutMs = TICKS_TO_MS( pCellularSocketContext->cellularSocketHandle->sendTimeoutMs );
        }

        /* Loop sending data until data is sent completely or timeout. */
        while( bytesToSend > 0U )
        {
            socketStatus = Cellular_SocketSend( CellularHandle,
                                                cellularSocketHandle,
                                                &buf[ retSendLength ],
                                                bytesToSend,
                                                &sentLength );

            if( socketStatus == CELLULAR_SUCCESS )
            {
                retSendLength = retSendLength + ( BaseType_t ) sentLength;
                bytesToSend = bytesToSend - sentLength;
            }

            /* Check socket status or timeout break. */
            if( ( socketStatus != CELLULAR_SUCCESS ) ||
                ( _calculateElapsedTime( entryTimeMs, sendTimeoutMs, &elapsedTimeMs ) ) )
            {
                if( socketStatus != CELLULAR_SUCCESS )
                {
                    if( socketStatus == CELLULAR_SOCKET_CLOSED )
                    {
                        /* Socket already closed. No data is sent. */
                        retSendLength = 0;
                    }
                    else
                    {
                        retSendLength = ( BaseType_t ) TCP_SOCKETS_ERRNO_ERROR;
                    }
                }

                break;
            }
        }

        IotLogDebug( "Sockets_Send expect %d write %d", xDataLength, sentLength );
    }

    return retSendLength;
#endif
}

/*-----------------------------------------------------------*/

static CellularError_t Sockets_GetHostByName( const char * pcHostName , const uint8_t * addr)
{
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
    return Cellular_GetHostByName( CellularHandle,
                                   RM_CELLULAR_RYZ_DEFAULT_BEARER_CONTEXT_ID,
                                   pcHostName,
                                   ( char * ) addr );
#else
    CellularError_t ret;

    ret = Cellular_GetHostByName(CellularHandle, RM_CELLULAR_RYZ_DEFAULT_BEARER_CONTEXT_ID,
                                    pcHostName,
                                    (char *)addr);

    return ret;
#endif
}

/*-----------------------------------------------------------*/
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#pragma section
#endif

